app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "room_id", "bady", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 2], ["bady", "hi"], ["created_at", "2022-10-31 15:07:11.466320"], ["updated_at", "2022-10-31 15:07:11.466320"]]
---
    def create
        @messages = current_user.messages.create(bady: msg_params[:bady],room_id:params[:room_id])