app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ? ORDER BY "messages"."created_at" ASC  [["room_id", 1]]
---
  def show
    @single_room = Room.find(params[:id])
    @room = Room.new
    @rooms = Room.public_rooms
    @message = Message.new
    @messages = @single_room.messages.order(created_at: :asc)

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "next room"], ["is_private", 0], ["created_at", "2022-10-31 16:29:58.503639"], ["updated_at", "2022-10-31 16:29:58.503639"]]
---
  def create
    @room = Room.create(name:params["room"]["name"])