app/models/message.rb

  def confirm_participent
    return unless room.is_private

    is_Participant = Participant.where(user_id: user.id, room_id: room.id).first
---
SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = ? AND "participants"."room_id" = ? ORDER BY "participants"."id" ASC LIMIT ?  [["user_id", 1], ["room_id", 11], ["LIMIT", 1]]