app/models/room.rb

    def self.create_private_room(users, room_name)
      single_room = Room.create(name: room_name, is_private: true)
      users.each do |user|
        Participant.create(user_id: user.id, room_id: single_room.id)
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "private_1_3"], ["is_private", 1], ["created_at", "2022-11-04 19:46:40.868246"], ["updated_at", "2022-11-04 19:46:40.868246"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["room_id", 13], ["created_at", "2022-11-04 20:11:14.283553"], ["updated_at", "2022-11-04 20:11:14.283553"]]